SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_correl.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 CORREL register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_CORREL_H
#define EFR32FG25_CORREL_H
#define CORREL_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_CORREL CORREL
 * @{
 * @brief EFR32FG25 CORREL Register Declaration.
 *****************************************************************************/

/** CORREL REFSEQ Register Group Declaration. */
typedef struct {
  __IOM uint32_t VAL;                                /**< Reference Sequence                                 */
} CORREL_REFSEQ_TypeDef;

/** CORREL Register Declaration. */
typedef struct {
  __IM uint32_t         IPVERSION;              /**< IP Version ID                                      */
  __IOM uint32_t        EN;                     /**< Module Enable                                      */
  __IOM uint32_t        SWRST;                  /**< Software Reset                                     */
  __IOM uint32_t        CONNECT;                /**< FIFO Connect                                       */
  __IOM uint32_t        DISCLK;                 /**< Disable Clocks                                     */
  uint32_t              RESERVED0[3U];          /**< Reserved for future use                            */
  __IOM uint32_t        FIFOIN;                 /**< New Register                                       */
  uint32_t              RESERVED1[7U];          /**< Reserved for future use                            */
  __IM uint32_t         FIFOOUT;                /**< New Register                                       */
  uint32_t              RESERVED2[23U];         /**< Reserved for future use                            */
  uint32_t              RESERVED3[1U];          /**< Reserved for future use                            */
  uint32_t              RESERVED4[7U];          /**< Reserved for future use                            */
  uint32_t              RESERVED5[1U];          /**< Reserved for future use                            */
  uint32_t              RESERVED6[79U];         /**< Reserved for future use                            */
  __IOM uint32_t        CFG;                    /**< Configuration                                      */
  __IOM uint32_t        CTRL;                   /**< Control                                            */
  __IOM uint32_t        SHIFTRES;               /**< Result Shift Amount                                */
  __IOM uint32_t        IF;                     /**< Interrupt Flags                                    */
  __IOM uint32_t        IEN;                    /**< Interrupt Enable                                   */
  __IM uint32_t         MAXCORR;                /**< Max Correlation Value                              */
  __IM uint32_t         MAXIDX;                 /**< Max Correlation Index                              */
  __IM uint32_t         DETSYMB;                /**< Detected Symbols                                   */
  __IOM uint32_t        TRECS;                  /**< TRECS Mode Configuration                           */
  __IOM uint32_t        THRESHOLD;              /**< Correlation Threshold                              */
  __IM uint32_t         SAMPNUM;                /**< Sample Number of Threshold Cross                   */
  __IM uint32_t         LASTSAMP;               /**< Last Sample Number                                 */
  __IOM uint32_t        NUMSKIP;                /**< Number of Output Samples to Skip                   */
  __IOM uint32_t        DATAFMT;                /**< Data Format                                        */
  uint32_t              RESERVED7[18U];         /**< Reserved for future use                            */
  CORREL_REFSEQ_TypeDef REFSEQ[8U];             /**<                                                    */
  uint32_t              RESERVED8[856U];        /**< Reserved for future use                            */
  __IM uint32_t         IPVERSION_SET;          /**< IP Version ID                                      */
  __IOM uint32_t        EN_SET;                 /**< Module Enable                                      */
  __IOM uint32_t        SWRST_SET;              /**< Software Reset                                     */
  __IOM uint32_t        CONNECT_SET;            /**< FIFO Connect                                       */
  __IOM uint32_t        DISCLK_SET;             /**< Disable Clocks                                     */
  uint32_t              RESERVED9[3U];          /**< Reserved for future use                            */
  __IOM uint32_t        FIFOIN_SET;             /**< New Register                                       */
  uint32_t              RESERVED10[7U];         /**< Reserved for future use                            */
  __IM uint32_t         FIFOOUT_SET;            /**< New Register                                       */
  uint32_t              RESERVED11[23U];        /**< Reserved for future use                            */
  uint32_t              RESERVED12[1U];         /**< Reserved for future use                            */
  uint32_t              RESERVED13[7U];         /**< Reserved for future use                            */
  uint32_t              RESERVED14[1U];         /**< Reserved for future use                            */
  uint32_t              RESERVED15[79U];        /**< Reserved for future use                            */
  __IOM uint32_t        CFG_SET;                /**< Configuration                                      */
  __IOM uint32_t        CTRL_SET;               /**< Control                                            */
  __IOM uint32_t        SHIFTRES_SET;           /**< Result Shift Amount                                */
  __IOM uint32_t        IF_SET;                 /**< Interrupt Flags                                    */
  __IOM uint32_t        IEN_SET;                /**< Interrupt Enable                                   */
  __IM uint32_t         MAXCORR_SET;            /**< Max Correlation Value                              */
  __IM uint32_t         MAXIDX_SET;             /**< Max Correlation Index                              */
  __IM uint32_t         DETSYMB_SET;            /**< Detected Symbols                                   */
  __IOM uint32_t        TRECS_SET;              /**< TRECS Mode Configuration                           */
  __IOM uint32_t        THRESHOLD_SET;          /**< Correlation Threshold                              */
  __IM uint32_t         SAMPNUM_SET;            /**< Sample Number of Threshold Cross                   */
  __IM uint32_t         LASTSAMP_SET;           /**< Last Sample Number                                 */
  __IOM uint32_t        NUMSKIP_SET;            /**< Number of Output Samples to Skip                   */
  __IOM uint32_t        DATAFMT_SET;            /**< Data Format                                        */
  uint32_t              RESERVED16[18U];        /**< Reserved for future use                            */
  CORREL_REFSEQ_TypeDef REFSEQ_SET[8U];         /**<                                                    */
  uint32_t              RESERVED17[856U];       /**< Reserved for future use                            */
  __IM uint32_t         IPVERSION_CLR;          /**< IP Version ID                                      */
  __IOM uint32_t        EN_CLR;                 /**< Module Enable                                      */
  __IOM uint32_t        SWRST_CLR;              /**< Software Reset                                     */
  __IOM uint32_t        CONNECT_CLR;            /**< FIFO Connect                                       */
  __IOM uint32_t        DISCLK_CLR;             /**< Disable Clocks                                     */
  uint32_t              RESERVED18[3U];         /**< Reserved for future use                            */
  __IOM uint32_t        FIFOIN_CLR;             /**< New Register                                       */
  uint32_t              RESERVED19[7U];         /**< Reserved for future use                            */
  __IM uint32_t         FIFOOUT_CLR;            /**< New Register                                       */
  uint32_t              RESERVED20[23U];        /**< Reserved for future use                            */
  uint32_t              RESERVED21[1U];         /**< Reserved for future use                            */
  uint32_t              RESERVED22[7U];         /**< Reserved for future use                            */
  uint32_t              RESERVED23[1U];         /**< Reserved for future use                            */
  uint32_t              RESERVED24[79U];        /**< Reserved for future use                            */
  __IOM uint32_t        CFG_CLR;                /**< Configuration                                      */
  __IOM uint32_t        CTRL_CLR;               /**< Control                                            */
  __IOM uint32_t        SHIFTRES_CLR;           /**< Result Shift Amount                                */
  __IOM uint32_t        IF_CLR;                 /**< Interrupt Flags                                    */
  __IOM uint32_t        IEN_CLR;                /**< Interrupt Enable                                   */
  __IM uint32_t         MAXCORR_CLR;            /**< Max Correlation Value                              */
  __IM uint32_t         MAXIDX_CLR;             /**< Max Correlation Index                              */
  __IM uint32_t         DETSYMB_CLR;            /**< Detected Symbols                                   */
  __IOM uint32_t        TRECS_CLR;              /**< TRECS Mode Configuration                           */
  __IOM uint32_t        THRESHOLD_CLR;          /**< Correlation Threshold                              */
  __IM uint32_t         SAMPNUM_CLR;            /**< Sample Number of Threshold Cross                   */
  __IM uint32_t         LASTSAMP_CLR;           /**< Last Sample Number                                 */
  __IOM uint32_t        NUMSKIP_CLR;            /**< Number of Output Samples to Skip                   */
  __IOM uint32_t        DATAFMT_CLR;            /**< Data Format                                        */
  uint32_t              RESERVED25[18U];        /**< Reserved for future use                            */
  CORREL_REFSEQ_TypeDef REFSEQ_CLR[8U];         /**<                                                    */
  uint32_t              RESERVED26[856U];       /**< Reserved for future use                            */
  __IM uint32_t         IPVERSION_TGL;          /**< IP Version ID                                      */
  __IOM uint32_t        EN_TGL;                 /**< Module Enable                                      */
  __IOM uint32_t        SWRST_TGL;              /**< Software Reset                                     */
  __IOM uint32_t        CONNECT_TGL;            /**< FIFO Connect                                       */
  __IOM uint32_t        DISCLK_TGL;             /**< Disable Clocks                                     */
  uint32_t              RESERVED27[3U];         /**< Reserved for future use                            */
  __IOM uint32_t        FIFOIN_TGL;             /**< New Register                                       */
  uint32_t              RESERVED28[7U];         /**< Reserved for future use                            */
  __IM uint32_t         FIFOOUT_TGL;            /**< New Register                                       */
  uint32_t              RESERVED29[23U];        /**< Reserved for future use                            */
  uint32_t              RESERVED30[1U];         /**< Reserved for future use                            */
  uint32_t              RESERVED31[7U];         /**< Reserved for future use                            */
  uint32_t              RESERVED32[1U];         /**< Reserved for future use                            */
  uint32_t              RESERVED33[79U];        /**< Reserved for future use                            */
  __IOM uint32_t        CFG_TGL;                /**< Configuration                                      */
  __IOM uint32_t        CTRL_TGL;               /**< Control                                            */
  __IOM uint32_t        SHIFTRES_TGL;           /**< Result Shift Amount                                */
  __IOM uint32_t        IF_TGL;                 /**< Interrupt Flags                                    */
  __IOM uint32_t        IEN_TGL;                /**< Interrupt Enable                                   */
  __IM uint32_t         MAXCORR_TGL;            /**< Max Correlation Value                              */
  __IM uint32_t         MAXIDX_TGL;             /**< Max Correlation Index                              */
  __IM uint32_t         DETSYMB_TGL;            /**< Detected Symbols                                   */
  __IOM uint32_t        TRECS_TGL;              /**< TRECS Mode Configuration                           */
  __IOM uint32_t        THRESHOLD_TGL;          /**< Correlation Threshold                              */
  __IM uint32_t         SAMPNUM_TGL;            /**< Sample Number of Threshold Cross                   */
  __IM uint32_t         LASTSAMP_TGL;           /**< Last Sample Number                                 */
  __IOM uint32_t        NUMSKIP_TGL;            /**< Number of Output Samples to Skip                   */
  __IOM uint32_t        DATAFMT_TGL;            /**< Data Format                                        */
  uint32_t              RESERVED34[18U];        /**< Reserved for future use                            */
  CORREL_REFSEQ_TypeDef REFSEQ_TGL[8U];         /**<                                                    */
} CORREL_TypeDef;
/** @} End of group EFR32FG25_CORREL */

/**************************************************************************//**
 * @addtogroup EFR32FG25_CORREL
 * @{
 * @defgroup EFR32FG25_CORREL_BitFields CORREL Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for CORREL IPVERSION */
#define _CORREL_IPVERSION_RESETVALUE           0x00000001UL                               /**< Default value for CORREL_IPVERSION          */
#define _CORREL_IPVERSION_MASK                 0xFFFFFFFFUL                               /**< Mask for CORREL_IPVERSION                   */
#define _CORREL_IPVERSION_IPVERSION_SHIFT      0                                          /**< Shift value for CORREL_IPVERSION            */
#define _CORREL_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                               /**< Bit mask for CORREL_IPVERSION               */
#define _CORREL_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                               /**< Mode DEFAULT for CORREL_IPVERSION           */
#define CORREL_IPVERSION_IPVERSION_DEFAULT     (_CORREL_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for CORREL_IPVERSION   */

/* Bit fields for CORREL EN */
#define _CORREL_EN_RESETVALUE                  0x00000000UL                             /**< Default value for CORREL_EN                 */
#define _CORREL_EN_MASK                        0x00000003UL                             /**< Mask for CORREL_EN                          */
#define CORREL_EN_EN                           (0x1UL << 0)                             /**< Module Enable                               */
#define _CORREL_EN_EN_SHIFT                    0                                        /**< Shift value for CORREL_EN                   */
#define _CORREL_EN_EN_MASK                     0x1UL                                    /**< Bit mask for CORREL_EN                      */
#define _CORREL_EN_EN_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for CORREL_EN                  */
#define CORREL_EN_EN_DEFAULT                   (_CORREL_EN_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for CORREL_EN          */
#define CORREL_EN_DISABLING                    (0x1UL << 1)                             /**< Disablement Busy Status                     */
#define _CORREL_EN_DISABLING_SHIFT             1                                        /**< Shift value for CORREL_DISABLING            */
#define _CORREL_EN_DISABLING_MASK              0x2UL                                    /**< Bit mask for CORREL_DISABLING               */
#define _CORREL_EN_DISABLING_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for CORREL_EN                  */
#define CORREL_EN_DISABLING_DEFAULT            (_CORREL_EN_DISABLING_DEFAULT << 1)      /**< Shifted mode DEFAULT for CORREL_EN          */

