SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_correl.h
/* Bit fields for CORREL SWRST */
#define _CORREL_SWRST_RESETVALUE               0x00000000UL                             /**< Default value for CORREL_SWRST              */
#define _CORREL_SWRST_MASK                     0x00000003UL                             /**< Mask for CORREL_SWRST                       */
#define CORREL_SWRST_SWRST                     (0x1UL << 0)                             /**< Software Reset Command                      */
#define _CORREL_SWRST_SWRST_SHIFT              0                                        /**< Shift value for CORREL_SWRST                */
#define _CORREL_SWRST_SWRST_MASK               0x1UL                                    /**< Bit mask for CORREL_SWRST                   */
#define _CORREL_SWRST_SWRST_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORREL_SWRST               */
#define CORREL_SWRST_SWRST_DEFAULT             (_CORREL_SWRST_SWRST_DEFAULT << 0)       /**< Shifted mode DEFAULT for CORREL_SWRST       */
#define CORREL_SWRST_RESETTING                 (0x1UL << 1)                             /**< Software Reset Busy Status                  */
#define _CORREL_SWRST_RESETTING_SHIFT          1                                        /**< Shift value for CORREL_RESETTING            */
#define _CORREL_SWRST_RESETTING_MASK           0x2UL                                    /**< Bit mask for CORREL_RESETTING               */
#define _CORREL_SWRST_RESETTING_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for CORREL_SWRST               */
#define CORREL_SWRST_RESETTING_DEFAULT         (_CORREL_SWRST_RESETTING_DEFAULT << 1)   /**< Shifted mode DEFAULT for CORREL_SWRST       */

/* Bit fields for CORREL CONNECT */
#define _CORREL_CONNECT_RESETVALUE             0x00000000UL                             /**< Default value for CORREL_CONNECT            */
#define _CORREL_CONNECT_MASK                   0x00000101UL                             /**< Mask for CORREL_CONNECT                     */
#define CORREL_CONNECT_IN                      (0x1UL << 0)                             /**< Input FIFO connect                          */
#define _CORREL_CONNECT_IN_SHIFT               0                                        /**< Shift value for CORREL_IN                   */
#define _CORREL_CONNECT_IN_MASK                0x1UL                                    /**< Bit mask for CORREL_IN                      */
#define _CORREL_CONNECT_IN_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORREL_CONNECT             */
#define CORREL_CONNECT_IN_DEFAULT              (_CORREL_CONNECT_IN_DEFAULT << 0)        /**< Shifted mode DEFAULT for CORREL_CONNECT     */
#define CORREL_CONNECT_OUT                     (0x1UL << 8)                             /**< Output FIFO connect                         */
#define _CORREL_CONNECT_OUT_SHIFT              8                                        /**< Shift value for CORREL_OUT                  */
#define _CORREL_CONNECT_OUT_MASK               0x100UL                                  /**< Bit mask for CORREL_OUT                     */
#define _CORREL_CONNECT_OUT_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORREL_CONNECT             */
#define CORREL_CONNECT_OUT_DEFAULT             (_CORREL_CONNECT_OUT_DEFAULT << 8)       /**< Shifted mode DEFAULT for CORREL_CONNECT     */

/* Bit fields for CORREL DISCLK */
#define _CORREL_DISCLK_RESETVALUE              0x00000002UL                             /**< Default value for CORREL_DISCLK             */
#define _CORREL_DISCLK_MASK                    0x00000003UL                             /**< Mask for CORREL_DISCLK                      */
#define _CORREL_DISCLK_DISCLK_SHIFT            0                                        /**< Shift value for CORREL_DISCLK               */
#define _CORREL_DISCLK_DISCLK_MASK             0x3UL                                    /**< Bit mask for CORREL_DISCLK                  */
#define _CORREL_DISCLK_DISCLK_DEFAULT          0x00000002UL                             /**< Mode DEFAULT for CORREL_DISCLK              */
#define _CORREL_DISCLK_DISCLK_NONE             0x00000000UL                             /**< Mode NONE for CORREL_DISCLK                 */
#define _CORREL_DISCLK_DISCLK_ALL              0x00000001UL                             /**< Mode ALL for CORREL_DISCLK                  */
#define _CORREL_DISCLK_DISCLK_AUTO             0x00000002UL                             /**< Mode AUTO for CORREL_DISCLK                 */
#define CORREL_DISCLK_DISCLK_DEFAULT           (_CORREL_DISCLK_DISCLK_DEFAULT << 0)     /**< Shifted mode DEFAULT for CORREL_DISCLK      */
#define CORREL_DISCLK_DISCLK_NONE              (_CORREL_DISCLK_DISCLK_NONE << 0)        /**< Shifted mode NONE for CORREL_DISCLK         */
#define CORREL_DISCLK_DISCLK_ALL               (_CORREL_DISCLK_DISCLK_ALL << 0)         /**< Shifted mode ALL for CORREL_DISCLK          */
#define CORREL_DISCLK_DISCLK_AUTO              (_CORREL_DISCLK_DISCLK_AUTO << 0)        /**< Shifted mode AUTO for CORREL_DISCLK         */

/* Bit fields for CORREL FIFOIN */
#define _CORREL_FIFOIN_RESETVALUE              0x00000000UL                             /**< Default value for CORREL_FIFOIN             */
#define _CORREL_FIFOIN_MASK                    0x1FFF3F0FUL                             /**< Mask for CORREL_FIFOIN                      */
#define _CORREL_FIFOIN_FID_SHIFT               0                                        /**< Shift value for CORREL_FID                  */
#define _CORREL_FIFOIN_FID_MASK                0xFUL                                    /**< Bit mask for CORREL_FID                     */
#define _CORREL_FIFOIN_FID_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORREL_FIFOIN              */
#define CORREL_FIFOIN_FID_DEFAULT              (_CORREL_FIFOIN_FID_DEFAULT << 0)        /**< Shifted mode DEFAULT for CORREL_FIFOIN      */
#define _CORREL_FIFOIN_CID_SHIFT               8                                        /**< Shift value for CORREL_CID                  */
#define _CORREL_FIFOIN_CID_MASK                0x3F00UL                                 /**< Bit mask for CORREL_CID                     */
#define _CORREL_FIFOIN_CID_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORREL_FIFOIN              */
#define CORREL_FIFOIN_CID_DEFAULT              (_CORREL_FIFOIN_CID_DEFAULT << 8)        /**< Shifted mode DEFAULT for CORREL_FIFOIN      */
#define _CORREL_FIFOIN_REM_SHIFT               16                                       /**< Shift value for CORREL_REM                  */
#define _CORREL_FIFOIN_REM_MASK                0xFF0000UL                               /**< Bit mask for CORREL_REM                     */
#define _CORREL_FIFOIN_REM_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORREL_FIFOIN              */
#define CORREL_FIFOIN_REM_DEFAULT              (_CORREL_FIFOIN_REM_DEFAULT << 16)       /**< Shifted mode DEFAULT for CORREL_FIFOIN      */
#define _CORREL_FIFOIN_ALARM_SHIFT             24                                       /**< Shift value for CORREL_ALARM                */
#define _CORREL_FIFOIN_ALARM_MASK              0x1F000000UL                             /**< Bit mask for CORREL_ALARM                   */
#define _CORREL_FIFOIN_ALARM_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for CORREL_FIFOIN              */
#define CORREL_FIFOIN_ALARM_DEFAULT            (_CORREL_FIFOIN_ALARM_DEFAULT << 24)     /**< Shifted mode DEFAULT for CORREL_FIFOIN      */

/* Bit fields for CORREL FIFOOUT */
#define _CORREL_FIFOOUT_RESETVALUE             0x00000000UL                             /**< Default value for CORREL_FIFOOUT            */
#define _CORREL_FIFOOUT_MASK                   0x1FFF0000UL                             /**< Mask for CORREL_FIFOOUT                     */
#define _CORREL_FIFOOUT_CNT_SHIFT              16                                       /**< Shift value for CORREL_CNT                  */
#define _CORREL_FIFOOUT_CNT_MASK               0xFF0000UL                               /**< Bit mask for CORREL_CNT                     */
#define _CORREL_FIFOOUT_CNT_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORREL_FIFOOUT             */
#define CORREL_FIFOOUT_CNT_DEFAULT             (_CORREL_FIFOOUT_CNT_DEFAULT << 16)      /**< Shifted mode DEFAULT for CORREL_FIFOOUT     */
#define _CORREL_FIFOOUT_ALARM_SHIFT            24                                       /**< Shift value for CORREL_ALARM                */
#define _CORREL_FIFOOUT_ALARM_MASK             0x1F000000UL                             /**< Bit mask for CORREL_ALARM                   */
#define _CORREL_FIFOOUT_ALARM_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CORREL_FIFOOUT             */
#define CORREL_FIFOOUT_ALARM_DEFAULT           (_CORREL_FIFOOUT_ALARM_DEFAULT << 24)    /**< Shifted mode DEFAULT for CORREL_FIFOOUT     */

/* Bit fields for CORREL CFG */
#define _CORREL_CFG_RESETVALUE                 0x00000000UL                             /**< Default value for CORREL_CFG                */
#define _CORREL_CFG_MASK                       0x777FFFFFUL                             /**< Mask for CORREL_CFG                         */
#define _CORREL_CFG_NS_SHIFT                   0                                        /**< Shift value for CORREL_NS                   */
#define _CORREL_CFG_NS_MASK                    0xFFUL                                   /**< Bit mask for CORREL_NS                      */
#define _CORREL_CFG_NS_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for CORREL_CFG                 */
#define CORREL_CFG_NS_DEFAULT                  (_CORREL_CFG_NS_DEFAULT << 0)            /**< Shifted mode DEFAULT for CORREL_CFG         */
#define _CORREL_CFG_L_SHIFT                    8                                        /**< Shift value for CORREL_L                    */
#define _CORREL_CFG_L_MASK                     0xFF00UL                                 /**< Bit mask for CORREL_L                       */
#define _CORREL_CFG_L_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for CORREL_CFG                 */
#define CORREL_CFG_L_DEFAULT                   (_CORREL_CFG_L_DEFAULT << 8)             /**< Shifted mode DEFAULT for CORREL_CFG         */
#define _CORREL_CFG_K_SHIFT                    16                                       /**< Shift value for CORREL_K                    */
#define _CORREL_CFG_K_MASK                     0x7F0000UL                               /**< Bit mask for CORREL_K                       */
#define _CORREL_CFG_K_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for CORREL_CFG                 */
#define CORREL_CFG_K_DEFAULT                   (_CORREL_CFG_K_DEFAULT << 16)            /**< Shifted mode DEFAULT for CORREL_CFG         */
#define CORREL_CFG_SEQBAR                      (0x1UL << 24)                            /**< Complementary Sequences                     */
#define _CORREL_CFG_SEQBAR_SHIFT               24                                       /**< Shift value for CORREL_SEQBAR               */
#define _CORREL_CFG_SEQBAR_MASK                0x1000000UL                              /**< Bit mask for CORREL_SEQBAR                  */
#define _CORREL_CFG_SEQBAR_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORREL_CFG                 */
#define _CORREL_CFG_SEQBAR_NON_COMP            0x00000000UL                             /**< Mode NON_COMP for CORREL_CFG                */
#define _CORREL_CFG_SEQBAR_COMP                0x00000001UL                             /**< Mode COMP for CORREL_CFG                    */
#define CORREL_CFG_SEQBAR_DEFAULT              (_CORREL_CFG_SEQBAR_DEFAULT << 24)       /**< Shifted mode DEFAULT for CORREL_CFG         */
#define CORREL_CFG_SEQBAR_NON_COMP             (_CORREL_CFG_SEQBAR_NON_COMP << 24)      /**< Shifted mode NON_COMP for CORREL_CFG        */
#define CORREL_CFG_SEQBAR_COMP                 (_CORREL_CFG_SEQBAR_COMP << 24)          /**< Shifted mode COMP for CORREL_CFG            */
#define CORREL_CFG_ODDEVEN                     (0x1UL << 25)                            /**< Odd or Even Sequence Select                 */
#define _CORREL_CFG_ODDEVEN_SHIFT              25                                       /**< Shift value for CORREL_ODDEVEN              */
#define _CORREL_CFG_ODDEVEN_MASK               0x2000000UL                              /**< Bit mask for CORREL_ODDEVEN                 */
#define _CORREL_CFG_ODDEVEN_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORREL_CFG                 */
#define CORREL_CFG_ODDEVEN_DEFAULT             (_CORREL_CFG_ODDEVEN_DEFAULT << 25)      /**< Shifted mode DEFAULT for CORREL_CFG         */
#define CORREL_CFG_CORRINV                     (0x1UL << 26)                            /**< Correlation Invert                          */
#define _CORREL_CFG_CORRINV_SHIFT              26                                       /**< Shift value for CORREL_CORRINV              */
#define _CORREL_CFG_CORRINV_MASK               0x4000000UL                              /**< Bit mask for CORREL_CORRINV                 */
#define _CORREL_CFG_CORRINV_DEFAULT            0x00000000UL                             /**< Mode DEFAULT for CORREL_CFG                 */
#define CORREL_CFG_CORRINV_DEFAULT             (_CORREL_CFG_CORRINV_DEFAULT << 26)      /**< Shifted mode DEFAULT for CORREL_CFG         */
#define _CORREL_CFG_MODE_SHIFT                 28                                       /**< Shift value for CORREL_MODE                 */
#define _CORREL_CFG_MODE_MASK                  0x70000000UL                             /**< Bit mask for CORREL_MODE                    */
#define _CORREL_CFG_MODE_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for CORREL_CFG                 */
#define _CORREL_CFG_MODE_DSSS_TIMING_DET       0x00000000UL                             /**< Mode DSSS_TIMING_DET for CORREL_CFG         */
#define _CORREL_CFG_MODE_DSSS_SYMB_DET         0x00000001UL                             /**< Mode DSSS_SYMB_DET for CORREL_CFG           */
#define _CORREL_CFG_MODE_TRECS                 0x00000002UL                             /**< Mode TRECS for CORREL_CFG                   */
#define CORREL_CFG_MODE_DEFAULT                (_CORREL_CFG_MODE_DEFAULT << 28)         /**< Shifted mode DEFAULT for CORREL_CFG         */
#define CORREL_CFG_MODE_DSSS_TIMING_DET        (_CORREL_CFG_MODE_DSSS_TIMING_DET << 28) /**< Shifted mode DSSS_TIMING_DET for CORREL_CFG */
#define CORREL_CFG_MODE_DSSS_SYMB_DET          (_CORREL_CFG_MODE_DSSS_SYMB_DET << 28)   /**< Shifted mode DSSS_SYMB_DET for CORREL_CFG   */
#define CORREL_CFG_MODE_TRECS                  (_CORREL_CFG_MODE_TRECS << 28)           /**< Shifted mode TRECS for CORREL_CFG           */

