SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_correl.h
/* Bit fields for CORREL CTRL */
#define _CORREL_CTRL_RESETVALUE                0x00000000UL                             /**< Default value for CORREL_CTRL               */
#define _CORREL_CTRL_MASK                      0x00000703UL                             /**< Mask for CORREL_CTRL                        */
#define CORREL_CTRL_START                      (0x1UL << 0)                             /**< Start Correlator                            */
#define _CORREL_CTRL_START_SHIFT               0                                        /**< Shift value for CORREL_START                */
#define _CORREL_CTRL_START_MASK                0x1UL                                    /**< Bit mask for CORREL_START                   */
#define _CORREL_CTRL_START_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORREL_CTRL                */
#define CORREL_CTRL_START_DEFAULT              (_CORREL_CTRL_START_DEFAULT << 0)        /**< Shifted mode DEFAULT for CORREL_CTRL        */
#define CORREL_CTRL_STOP                       (0x1UL << 1)                             /**< Stop Correlator                             */
#define _CORREL_CTRL_STOP_SHIFT                1                                        /**< Shift value for CORREL_STOP                 */
#define _CORREL_CTRL_STOP_MASK                 0x2UL                                    /**< Bit mask for CORREL_STOP                    */
#define _CORREL_CTRL_STOP_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for CORREL_CTRL                */
#define CORREL_CTRL_STOP_DEFAULT               (_CORREL_CTRL_STOP_DEFAULT << 1)         /**< Shifted mode DEFAULT for CORREL_CTRL        */
#define CORREL_CTRL_THRESRST                   (0x1UL << 8)                             /**< Reset Threshold Detection                   */
#define _CORREL_CTRL_THRESRST_SHIFT            8                                        /**< Shift value for CORREL_THRESRST             */
#define _CORREL_CTRL_THRESRST_MASK             0x100UL                                  /**< Bit mask for CORREL_THRESRST                */
#define _CORREL_CTRL_THRESRST_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CORREL_CTRL                */
#define CORREL_CTRL_THRESRST_DEFAULT           (_CORREL_CTRL_THRESRST_DEFAULT << 8)     /**< Shifted mode DEFAULT for CORREL_CTRL        */
#define CORREL_CTRL_SAMPNRST                   (0x1UL << 9)                             /**< Reset Sample Number                         */
#define _CORREL_CTRL_SAMPNRST_SHIFT            9                                        /**< Shift value for CORREL_SAMPNRST             */
#define _CORREL_CTRL_SAMPNRST_MASK             0x200UL                                  /**< Bit mask for CORREL_SAMPNRST                */
#define _CORREL_CTRL_SAMPNRST_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CORREL_CTRL                */
#define CORREL_CTRL_SAMPNRST_DEFAULT           (_CORREL_CTRL_SAMPNRST_DEFAULT << 9)     /**< Shifted mode DEFAULT for CORREL_CTRL        */
#define CORREL_CTRL_SKIPRST                    (0x1UL << 10)                            /**< Reset the Output Sample Skip Counter        */
#define _CORREL_CTRL_SKIPRST_SHIFT             10                                       /**< Shift value for CORREL_SKIPRST              */
#define _CORREL_CTRL_SKIPRST_MASK              0x400UL                                  /**< Bit mask for CORREL_SKIPRST                 */
#define _CORREL_CTRL_SKIPRST_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for CORREL_CTRL                */
#define CORREL_CTRL_SKIPRST_DEFAULT            (_CORREL_CTRL_SKIPRST_DEFAULT << 10)     /**< Shifted mode DEFAULT for CORREL_CTRL        */

/* Bit fields for CORREL SHIFTRES */
#define _CORREL_SHIFTRES_RESETVALUE            0x00000000UL                             /**< Default value for CORREL_SHIFTRES           */
#define _CORREL_SHIFTRES_MASK                  0x0000001FUL                             /**< Mask for CORREL_SHIFTRES                    */
#define _CORREL_SHIFTRES_SHIFTRES_SHIFT        0                                        /**< Shift value for CORREL_SHIFTRES             */
#define _CORREL_SHIFTRES_SHIFTRES_MASK         0x1FUL                                   /**< Bit mask for CORREL_SHIFTRES                */
#define _CORREL_SHIFTRES_SHIFTRES_DEFAULT      0x00000000UL                             /**< Mode DEFAULT for CORREL_SHIFTRES            */
#define CORREL_SHIFTRES_SHIFTRES_DEFAULT       (_CORREL_SHIFTRES_SHIFTRES_DEFAULT << 0) /**< Shifted mode DEFAULT for CORREL_SHIFTRES    */

/* Bit fields for CORREL IF */
#define _CORREL_IF_RESETVALUE                  0x00000000UL                             /**< Default value for CORREL_IF                 */
#define _CORREL_IF_MASK                        0x00000003UL                             /**< Mask for CORREL_IF                          */
#define CORREL_IF_DONE                         (0x1UL << 0)                             /**< New BitField                                */
#define _CORREL_IF_DONE_SHIFT                  0                                        /**< Shift value for CORREL_DONE                 */
#define _CORREL_IF_DONE_MASK                   0x1UL                                    /**< Bit mask for CORREL_DONE                    */
#define _CORREL_IF_DONE_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for CORREL_IF                  */
#define CORREL_IF_DONE_DEFAULT                 (_CORREL_IF_DONE_DEFAULT << 0)           /**< Shifted mode DEFAULT for CORREL_IF          */
#define CORREL_IF_THRES                        (0x1UL << 1)                             /**< New BitField                                */
#define _CORREL_IF_THRES_SHIFT                 1                                        /**< Shift value for CORREL_THRES                */
#define _CORREL_IF_THRES_MASK                  0x2UL                                    /**< Bit mask for CORREL_THRES                   */
#define _CORREL_IF_THRES_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for CORREL_IF                  */
#define CORREL_IF_THRES_DEFAULT                (_CORREL_IF_THRES_DEFAULT << 1)          /**< Shifted mode DEFAULT for CORREL_IF          */

/* Bit fields for CORREL IEN */
#define _CORREL_IEN_RESETVALUE                 0x00000000UL                             /**< Default value for CORREL_IEN                */
#define _CORREL_IEN_MASK                       0x00000003UL                             /**< Mask for CORREL_IEN                         */
#define CORREL_IEN_DONE                        (0x1UL << 0)                             /**< New BitField                                */
#define _CORREL_IEN_DONE_SHIFT                 0                                        /**< Shift value for CORREL_DONE                 */
#define _CORREL_IEN_DONE_MASK                  0x1UL                                    /**< Bit mask for CORREL_DONE                    */
#define _CORREL_IEN_DONE_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for CORREL_IEN                 */
#define CORREL_IEN_DONE_DEFAULT                (_CORREL_IEN_DONE_DEFAULT << 0)          /**< Shifted mode DEFAULT for CORREL_IEN         */
#define CORREL_IEN_THRES                       (0x1UL << 1)                             /**< New BitField                                */
#define _CORREL_IEN_THRES_SHIFT                1                                        /**< Shift value for CORREL_THRES                */
#define _CORREL_IEN_THRES_MASK                 0x2UL                                    /**< Bit mask for CORREL_THRES                   */
#define _CORREL_IEN_THRES_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for CORREL_IEN                 */
#define CORREL_IEN_THRES_DEFAULT               (_CORREL_IEN_THRES_DEFAULT << 1)         /**< Shifted mode DEFAULT for CORREL_IEN         */

