SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_correl.h
/* Bit fields for CORREL MAXCORR */
#define _CORREL_MAXCORR_RESETVALUE             0x00000000UL                             /**< Default value for CORREL_MAXCORR            */
#define _CORREL_MAXCORR_MASK                   0xFFFFFFFFUL                             /**< Mask for CORREL_MAXCORR                     */
#define _CORREL_MAXCORR_MAXCORR_SHIFT          0                                        /**< Shift value for CORREL_MAXCORR              */
#define _CORREL_MAXCORR_MAXCORR_MASK           0xFFFFFFFFUL                             /**< Bit mask for CORREL_MAXCORR                 */
#define _CORREL_MAXCORR_MAXCORR_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for CORREL_MAXCORR             */
#define CORREL_MAXCORR_MAXCORR_DEFAULT         (_CORREL_MAXCORR_MAXCORR_DEFAULT << 0)   /**< Shifted mode DEFAULT for CORREL_MAXCORR     */

/* Bit fields for CORREL MAXIDX */
#define _CORREL_MAXIDX_RESETVALUE              0x00000000UL                             /**< Default value for CORREL_MAXIDX             */
#define _CORREL_MAXIDX_MASK                    0x00000FFFUL                             /**< Mask for CORREL_MAXIDX                      */
#define _CORREL_MAXIDX_MAXIDX_SHIFT            0                                        /**< Shift value for CORREL_MAXIDX               */
#define _CORREL_MAXIDX_MAXIDX_MASK             0xFFFUL                                  /**< Bit mask for CORREL_MAXIDX                  */
#define _CORREL_MAXIDX_MAXIDX_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CORREL_MAXIDX              */
#define CORREL_MAXIDX_MAXIDX_DEFAULT           (_CORREL_MAXIDX_MAXIDX_DEFAULT << 0)     /**< Shifted mode DEFAULT for CORREL_MAXIDX      */

/* Bit fields for CORREL DETSYMB */
#define _CORREL_DETSYMB_RESETVALUE             0x00000000UL                             /**< Default value for CORREL_DETSYMB            */
#define _CORREL_DETSYMB_MASK                   0xFFFFFFFFUL                             /**< Mask for CORREL_DETSYMB                     */
#define _CORREL_DETSYMB_DETSYMB_SHIFT          0                                        /**< Shift value for CORREL_DETSYMB              */
#define _CORREL_DETSYMB_DETSYMB_MASK           0xFFFFFFFFUL                             /**< Bit mask for CORREL_DETSYMB                 */
#define _CORREL_DETSYMB_DETSYMB_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for CORREL_DETSYMB             */
#define CORREL_DETSYMB_DETSYMB_DEFAULT         (_CORREL_DETSYMB_DETSYMB_DEFAULT << 0)   /**< Shifted mode DEFAULT for CORREL_DETSYMB     */

/* Bit fields for CORREL TRECS */
#define _CORREL_TRECS_RESETVALUE               0x00000000UL                              /**< Default value for CORREL_TRECS              */
#define _CORREL_TRECS_MASK                     0x07FF0307UL                              /**< Mask for CORREL_TRECS                       */
#define _CORREL_TRECS_OSR_SHIFT                0                                         /**< Shift value for CORREL_OSR                  */
#define _CORREL_TRECS_OSR_MASK                 0x7UL                                     /**< Bit mask for CORREL_OSR                     */
#define _CORREL_TRECS_OSR_DEFAULT              0x00000000UL                              /**< Mode DEFAULT for CORREL_TRECS               */
#define CORREL_TRECS_OSR_DEFAULT               (_CORREL_TRECS_OSR_DEFAULT << 0)          /**< Shifted mode DEFAULT for CORREL_TRECS       */
#define CORREL_TRECS_MODEOUT                   (0x1UL << 8)                              /**< Output Mode                                 */
#define _CORREL_TRECS_MODEOUT_SHIFT            8                                         /**< Shift value for CORREL_MODEOUT              */
#define _CORREL_TRECS_MODEOUT_MASK             0x100UL                                   /**< Bit mask for CORREL_MODEOUT                 */
#define _CORREL_TRECS_MODEOUT_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for CORREL_TRECS               */
#define _CORREL_TRECS_MODEOUT_ALWAYS_ON        0x00000000UL                              /**< Mode ALWAYS_ON for CORREL_TRECS             */
#define _CORREL_TRECS_MODEOUT_POST_THRES       0x00000001UL                              /**< Mode POST_THRES for CORREL_TRECS            */
#define CORREL_TRECS_MODEOUT_DEFAULT           (_CORREL_TRECS_MODEOUT_DEFAULT << 8)      /**< Shifted mode DEFAULT for CORREL_TRECS       */
#define CORREL_TRECS_MODEOUT_ALWAYS_ON         (_CORREL_TRECS_MODEOUT_ALWAYS_ON << 8)    /**< Shifted mode ALWAYS_ON for CORREL_TRECS     */
#define CORREL_TRECS_MODEOUT_POST_THRES        (_CORREL_TRECS_MODEOUT_POST_THRES << 8)   /**< Shifted mode POST_THRES for CORREL_TRECS    */
#define CORREL_TRECS_SKIPFIRST                 (0x1UL << 9)                              /**< Skip First Output Samples                   */
#define _CORREL_TRECS_SKIPFIRST_SHIFT          9                                         /**< Shift value for CORREL_SKIPFIRST            */
#define _CORREL_TRECS_SKIPFIRST_MASK           0x200UL                                   /**< Bit mask for CORREL_SKIPFIRST               */
#define _CORREL_TRECS_SKIPFIRST_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for CORREL_TRECS               */
#define _CORREL_TRECS_SKIPFIRST_NO_SKIP        0x00000000UL                              /**< Mode NO_SKIP for CORREL_TRECS               */
#define _CORREL_TRECS_SKIPFIRST_SKIP_FIRST     0x00000001UL                              /**< Mode SKIP_FIRST for CORREL_TRECS            */
#define CORREL_TRECS_SKIPFIRST_DEFAULT         (_CORREL_TRECS_SKIPFIRST_DEFAULT << 9)    /**< Shifted mode DEFAULT for CORREL_TRECS       */
#define CORREL_TRECS_SKIPFIRST_NO_SKIP         (_CORREL_TRECS_SKIPFIRST_NO_SKIP << 9)    /**< Shifted mode NO_SKIP for CORREL_TRECS       */
#define CORREL_TRECS_SKIPFIRST_SKIP_FIRST      (_CORREL_TRECS_SKIPFIRST_SKIP_FIRST << 9) /**< Shifted mode SKIP_FIRST for CORREL_TRECS    */
#define _CORREL_TRECS_FWINSIZE_SHIFT           16                                        /**< Shift value for CORREL_FWINSIZE             */
#define _CORREL_TRECS_FWINSIZE_MASK            0x3FF0000UL                               /**< Bit mask for CORREL_FWINSIZE                */
#define _CORREL_TRECS_FWINSIZE_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for CORREL_TRECS               */
#define CORREL_TRECS_FWINSIZE_DEFAULT          (_CORREL_TRECS_FWINSIZE_DEFAULT << 16)    /**< Shifted mode DEFAULT for CORREL_TRECS       */
#define CORREL_TRECS_AUTODIS                   (0x1UL << 26)                             /**< Autodisable TRECS                           */
#define _CORREL_TRECS_AUTODIS_SHIFT            26                                        /**< Shift value for CORREL_AUTODIS              */
#define _CORREL_TRECS_AUTODIS_MASK             0x4000000UL                               /**< Bit mask for CORREL_AUTODIS                 */
#define _CORREL_TRECS_AUTODIS_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for CORREL_TRECS               */
#define _CORREL_TRECS_AUTODIS_DISABLED         0x00000000UL                              /**< Mode DISABLED for CORREL_TRECS              */
#define _CORREL_TRECS_AUTODIS_ENABLED          0x00000001UL                              /**< Mode ENABLED for CORREL_TRECS               */
#define CORREL_TRECS_AUTODIS_DEFAULT           (_CORREL_TRECS_AUTODIS_DEFAULT << 26)     /**< Shifted mode DEFAULT for CORREL_TRECS       */
#define CORREL_TRECS_AUTODIS_DISABLED          (_CORREL_TRECS_AUTODIS_DISABLED << 26)    /**< Shifted mode DISABLED for CORREL_TRECS      */
#define CORREL_TRECS_AUTODIS_ENABLED           (_CORREL_TRECS_AUTODIS_ENABLED << 26)     /**< Shifted mode ENABLED for CORREL_TRECS       */

/* Bit fields for CORREL THRESHOLD */
#define _CORREL_THRESHOLD_RESETVALUE           0x00000000UL                               /**< Default value for CORREL_THRESHOLD          */
#define _CORREL_THRESHOLD_MASK                 0xFFFFFFFFUL                               /**< Mask for CORREL_THRESHOLD                   */
#define _CORREL_THRESHOLD_THRESHOLD_SHIFT      0                                          /**< Shift value for CORREL_THRESHOLD            */
#define _CORREL_THRESHOLD_THRESHOLD_MASK       0xFFFFFFFFUL                               /**< Bit mask for CORREL_THRESHOLD               */
#define _CORREL_THRESHOLD_THRESHOLD_DEFAULT    0x00000000UL                               /**< Mode DEFAULT for CORREL_THRESHOLD           */
#define CORREL_THRESHOLD_THRESHOLD_DEFAULT     (_CORREL_THRESHOLD_THRESHOLD_DEFAULT << 0) /**< Shifted mode DEFAULT for CORREL_THRESHOLD   */

/* Bit fields for CORREL SAMPNUM */
#define _CORREL_SAMPNUM_RESETVALUE             0x00000000UL                             /**< Default value for CORREL_SAMPNUM            */
#define _CORREL_SAMPNUM_MASK                   0xFFFFFFFFUL                             /**< Mask for CORREL_SAMPNUM                     */
#define _CORREL_SAMPNUM_SAMPNUM_SHIFT          0                                        /**< Shift value for CORREL_SAMPNUM              */
#define _CORREL_SAMPNUM_SAMPNUM_MASK           0xFFFFFFFFUL                             /**< Bit mask for CORREL_SAMPNUM                 */
#define _CORREL_SAMPNUM_SAMPNUM_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for CORREL_SAMPNUM             */
#define CORREL_SAMPNUM_SAMPNUM_DEFAULT         (_CORREL_SAMPNUM_SAMPNUM_DEFAULT << 0)   /**< Shifted mode DEFAULT for CORREL_SAMPNUM     */

/* Bit fields for CORREL LASTSAMP */
#define _CORREL_LASTSAMP_RESETVALUE            0x00000000UL                             /**< Default value for CORREL_LASTSAMP           */
#define _CORREL_LASTSAMP_MASK                  0xFFFFFFFFUL                             /**< Mask for CORREL_LASTSAMP                    */
#define _CORREL_LASTSAMP_LASTSAMP_SHIFT        0                                        /**< Shift value for CORREL_LASTSAMP             */
#define _CORREL_LASTSAMP_LASTSAMP_MASK         0xFFFFFFFFUL                             /**< Bit mask for CORREL_LASTSAMP                */
#define _CORREL_LASTSAMP_LASTSAMP_DEFAULT      0x00000000UL                             /**< Mode DEFAULT for CORREL_LASTSAMP            */
#define CORREL_LASTSAMP_LASTSAMP_DEFAULT       (_CORREL_LASTSAMP_LASTSAMP_DEFAULT << 0) /**< Shifted mode DEFAULT for CORREL_LASTSAMP    */

/* Bit fields for CORREL NUMSKIP */
#define _CORREL_NUMSKIP_RESETVALUE             0x00000000UL                             /**< Default value for CORREL_NUMSKIP            */
#define _CORREL_NUMSKIP_MASK                   0x000000FFUL                             /**< Mask for CORREL_NUMSKIP                     */
#define _CORREL_NUMSKIP_NUMSKIP_SHIFT          0                                        /**< Shift value for CORREL_NUMSKIP              */
#define _CORREL_NUMSKIP_NUMSKIP_MASK           0xFFUL                                   /**< Bit mask for CORREL_NUMSKIP                 */
#define _CORREL_NUMSKIP_NUMSKIP_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for CORREL_NUMSKIP             */
#define CORREL_NUMSKIP_NUMSKIP_DEFAULT         (_CORREL_NUMSKIP_NUMSKIP_DEFAULT << 0)   /**< Shifted mode DEFAULT for CORREL_NUMSKIP     */

/* Bit fields for CORREL DATAFMT */
#define _CORREL_DATAFMT_RESETVALUE             0x00000000UL                             /**< Default value for CORREL_DATAFMT            */
#define _CORREL_DATAFMT_MASK                   0x00000007UL                             /**< Mask for CORREL_DATAFMT                     */
#define _CORREL_DATAFMT_IQSEL_SHIFT            0                                        /**< Shift value for CORREL_IQSEL                */
#define _CORREL_DATAFMT_IQSEL_MASK             0x7UL                                    /**< Bit mask for CORREL_IQSEL                   */
#define _CORREL_DATAFMT_IQSEL_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for CORREL_DATAFMT             */
#define _CORREL_DATAFMT_IQSEL_AUTO             0x00000000UL                             /**< Mode AUTO for CORREL_DATAFMT                */
#define _CORREL_DATAFMT_IQSEL_RES1             0x00000001UL                             /**< Mode RES1 for CORREL_DATAFMT                */
#define _CORREL_DATAFMT_IQSEL_SEL_I            0x00000002UL                             /**< Mode SEL_I for CORREL_DATAFMT               */
#define _CORREL_DATAFMT_IQSEL_SEL_Q            0x00000003UL                             /**< Mode SEL_Q for CORREL_DATAFMT               */
#define _CORREL_DATAFMT_IQSEL_ALT_EVEN         0x00000004UL                             /**< Mode ALT_EVEN for CORREL_DATAFMT            */
#define _CORREL_DATAFMT_IQSEL_ALT_ODD          0x00000005UL                             /**< Mode ALT_ODD for CORREL_DATAFMT             */
#define CORREL_DATAFMT_IQSEL_DEFAULT           (_CORREL_DATAFMT_IQSEL_DEFAULT << 0)     /**< Shifted mode DEFAULT for CORREL_DATAFMT     */
#define CORREL_DATAFMT_IQSEL_AUTO              (_CORREL_DATAFMT_IQSEL_AUTO << 0)        /**< Shifted mode AUTO for CORREL_DATAFMT        */
#define CORREL_DATAFMT_IQSEL_RES1              (_CORREL_DATAFMT_IQSEL_RES1 << 0)        /**< Shifted mode RES1 for CORREL_DATAFMT        */
#define CORREL_DATAFMT_IQSEL_SEL_I             (_CORREL_DATAFMT_IQSEL_SEL_I << 0)       /**< Shifted mode SEL_I for CORREL_DATAFMT       */
#define CORREL_DATAFMT_IQSEL_SEL_Q             (_CORREL_DATAFMT_IQSEL_SEL_Q << 0)       /**< Shifted mode SEL_Q for CORREL_DATAFMT       */
#define CORREL_DATAFMT_IQSEL_ALT_EVEN          (_CORREL_DATAFMT_IQSEL_ALT_EVEN << 0)    /**< Shifted mode ALT_EVEN for CORREL_DATAFMT    */
#define CORREL_DATAFMT_IQSEL_ALT_ODD           (_CORREL_DATAFMT_IQSEL_ALT_ODD << 0)     /**< Shifted mode ALT_ODD for CORREL_DATAFMT     */

/* Bit fields for CORREL VAL */
#define _CORREL_VAL_RESETVALUE                 0x00000000UL                             /**< Default value for CORREL_VAL                */
#define _CORREL_VAL_MASK                       0xFFFFFFFFUL                             /**< Mask for CORREL_VAL                         */
#define _CORREL_VAL_REFSEQ_SHIFT               0                                        /**< Shift value for CORREL_REFSEQ               */
#define _CORREL_VAL_REFSEQ_MASK                0xFFFFFFFFUL                             /**< Bit mask for CORREL_REFSEQ                  */
#define _CORREL_VAL_REFSEQ_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for CORREL_VAL                 */
#define CORREL_VAL_REFSEQ_DEFAULT              (_CORREL_VAL_REFSEQ_DEFAULT << 0)        /**< Shifted mode DEFAULT for CORREL_VAL         */

/** @} End of group EFR32FG25_CORREL_BitFields */
/** @} End of group EFR32FG25_CORREL */
/** @} End of group Parts */

#endif /* EFR32FG25_CORREL_H */
